def date_questions():
    return [
        {
          'id': 'date-0001',
          'grade': '8',
          'kind': 'date',
          'question': 'もし今日が月曜日だとしたら、100日後は何曜日になるか？',
          'answer': "金曜日",
        },
        {
          'id': 'date-0002',
          'grade': '8',
          'kind': 'date',
          'question': 'もし今日が2021年1月1日だとしたら、365日後は何日になるか？',
          'answer': "2022年1月1日",
        },
        {
          'id': 'date-0003',
          'grade': '8',
          'kind': 'date',
          'question': 'もし今日が2023年4月25日だとしたら、1週間後は何日になるか？',
          'answer': "2023年5月2日",
        },
        {
          'id': 'date-0004',
          'grade': '8',
          'kind': 'date',
          'question': 'もし今日が2023年4月25日だとしたら、2週間と2日後は何日になるか？',
          'answer': "2023年5月11日",
        },
        # {
        #   'id': 'date-0005',
        #   'grade': '8',
        #   'kind': 'date',
        #   'question': '4月25日から5月11日までに含まれる日数はいくつか（最終日を含む）？',
        #   'answer': "17",
        # },
        # {
        #   'id': 'date-0006',
        #   'grade': '8',
        #   'kind': 'date',
        #   'question': '4月25日から5月11日までに含まれる日数はいくつか（最終日を除く）？',
        #   'answer': "16",
        # },
        {
          'id': 'date-0007',
          'grade': '8',
          'kind': 'date',
          'question': 'もし今日が4月25日だとしたら、30日前は何日だったか？',
          'answer': "3月26日",
        },
        {
          'id': 'date-0008',
          'grade': '8',
          'kind': 'date',
          'question': 'もし今日が2004年2月27日だとしたら、2週間と2日後は何日になるか？',
          'answer': "2004年3月14日",
        },
        # {
        #   'id': 'date-0009',
        #   'grade': '8',
        #   'kind': 'date',
        #   'question': '支払いは毎週火曜日に行われます。2023年4月3日から2023年4月26日の間に何回の支払いが行われるでしょうか？',
        #   'answer': "4",
        # },
        # {
        #   'id': 'date-0010',
        #   'grade': '8',
        #   'kind': 'date',
        #   'question': '支払いは毎週火曜日に行われます。2023年4月5日から2023年4月28日の間に何回の支払いが行われるでしょうか？',
        #   'answer': "3",
        # },
    ]


